Revit 2024 API
BuiltInFailures.SketchFailures.BoundaryNoOverlap Property
 The split sketch is out of the boundary of split element sketch..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BoundaryNoOverlap { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryNoOverlap As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BoundaryNoOverlap {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace